Revit 2026 API

# RebarInSystemGetBarIndexFromReference Method

---

Given a reference that represents a part of a bar, this method will return the bar index.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetBarIndexFromReference(
	Reference barReference
)
```
```vb
Public Function GetBarIndexFromReference (
	barReference As Reference
) As Integer
```
```cpp
public:
int GetBarIndexFromReference(
	Reference^ barReference
)
```
```fsharp
member GetBarIndexFromReference :
        barReference : Reference -> int
```

#### Parameters

barReference Reference
     The Reference of the RebarInSystem element.

#### Return Value

Int32 The bar index the reference refers to.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The method returns an index between 0 and NumberOfBarPositions - 1 if it the given reference represents a part of a bar. Otherwise will return -1.

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace